---
kind: type
id: T:Autodesk.Revit.DB.SaveOptions
source: html/b93277ab-dfb6-a3a3-cfd9-8cee29cee644.htm
---
# Autodesk.Revit.DB.SaveOptions

This class contains options available for saving a document to disk.

## Syntax (C#)
```csharp
public class SaveOptions : IDisposable
```